Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: For the first question, the build system detects changes in the "inputs" to a given task by creating a checksum (or signature) of the task's inputs. If the checksum changes, the system assumes the inputs have changed and the task needs to be rerun. For the second question, the shared state (sstate) code tracks which tasks add which output to the build process. This means the output from a given task can be removed, upgraded or otherwise manipulated. The third question is partly addressed by the solution for the second question assuming the build system can fetch the sstate objects from remote locations and install them if they are deemed to be valid.
it_it: Per quanto riguarda la prima domanda, il sistema di compilazione rileva le modifiche agli "input" di un determinato task creando un checksum (o firma) degli input del task stesso. Se il checksum cambia, il sistema presume che gli input siano stati modificati e che il task debba essere rieseguito. Per quanto riguarda la seconda domanda, il codice dello shared state (sstate) tiene traccia di quali task aggiungono quale output al processo di build. Ciò significa che l'output di un determinato task può essere rimosso, aggiornato o altrimenti modificato. La terza domanda trova una risposta parziale nella soluzione per la seconda, presupponendo che il sistema di build possa recuperare gli oggetti sstate da posizioni remote e installarli se ritenuti validi.

source: For the following example, we will consider that the kernel recipe used is ``linux-yocto``. Instructions also apply to other kernel recipes named differently.
it_it: Nell'esempio seguente, considereremo come ricetta del kernel utilizzata ``linux-yocto``. Le istruzioni si applicano anche ad altre ricette del kernel con nomi diversi.

source: For the following sections let's assume that the build system has the shared state directory location (:term:`SSTATE_DIR`) defined as follows::
it_it: Per le sezioni seguenti, supponiamo che il sistema di build abbia la directory di shared state (:term:`SSTATE_DIR`) definita come segue::

source: For the following sections, we assume the core components of the :term:`Source Directory` are organized as follows:
it_it: Nelle sezioni seguenti, si presume che i componenti principali della :term:`Source Directory` siano organizzati come segue:

source: For the selected options in the above example, this would be:
it_it: Per le opzioni selezionate nell'esempio precedente, il nome sarebbe:

source: For this configuration, the default is to use two :term:`Built-in Fragments <Built-in Fragment>`:
it_it: Per questa configurazione, l'impostazione di default prevede l'utilizzo di due :term:`Frammenti Nativi <Built-in Fragment>`:

source: For this purpose, a good solution is to store the cover letter contents in the branch itself::
it_it: A questo scopo, una buona soluzione è quella di salvare il contenuto della lettera di presentazione direttamente nel branch::

source: For this section, we'll assume you've already performed the basic setup outlined in the ":ref:`profile-manual/intro:General Setup`" section.
it_it: Per questa sezione, daremo per scontato che sia stata già eseguito la configurazione di base descritta nella sezione ":ref:`profile-manual/intro:General Setup`".

source: For this section, we'll assume you've already performed the basic setup outlined in the ":ref:`profile-manual/intro:General Setup`" section. LTTng is run on the target system by connecting to it through SSH.
it_it: Per questa sezione, daremo per scontato che sia stata già eseguito la configurazione di base descritta nella sezione ":ref:`profile-manual/intro:General Setup`". LTTng viene eseguito sul sistema target connettendosi ad esso tramite SSH.

source: For this, BitBake uses the debug information to extract the sources used to build a binary. Therefore, it needs to be configured in the kernel to extract the kernel compiled files.
it_it: A tal fine, BitBake utilizza le informazioni di debug per estrarre i sorgenti utilizzati per la creazione di un binario. Pertanto, è necessario configurarlo nel kernel per estrarre i file compilati dal kernel.

source: For this, the ``bitbake-layers add-layer`` command can be used:
it_it: A tale scopo, si può utilizzare il comando ``bitbake-layers add-layer``:

source: For version comparisons, the ``opkg-compare-versions`` program from ``opkg-utils`` can be useful when attempting to determine how two version numbers compare to each other. Our definitive version comparison algorithm is the one within bitbake which aims to match those of the package managers and Debian policy closely.
it_it: Per i confronti tra versioni, il programma ``opkg-compare-versions`` di ``opkg-utils`` può essere utile per determinare come si confrontano due numeri di versione. Il nostro algoritmo definitivo per il confronto delle versioni è quello integrato in bitbake, che mira a essere il più possibile simile a quelli dei gestori di pacchetti e alle politiche di Debian.

source: For your BSP, you typically want to use an existing Yocto Project kernel recipe found in :term:`OpenEmbedded-Core (OE-Core)` at ``meta/recipes-kernel/linux``. You can append machine-specific changes to the kernel recipe by using a similarly named append file, which is located in the BSP Layer for your target device (e.g. the ``meta-bsp_root_name/recipes-kernel/linux`` directory).
it_it: Per il proprio BSP, in genere è consigliabile utilizzare una ricetta del kernel di Yocto Project esistente, reperibile in :term:`OpenEmbedded-Core (OE-Core)` in ``meta/recipes-kernel/linux``. È possibile aggiungere modifiche specifiche per la macchina alla ricetta del kernel utilizzando un file di append con un nome simile, che si trova nel layer BSP del dispositivo target (ad esempio, la directory ``meta-bsp_root_name/recipes-kernel/linux``).

source: Fragments can be listed, enabled and disabled with the :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>` command-line utility.
it_it: I frammenti possono essere elencati, abilitati e disabilitati tramite l'utility da riga di comando :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>`.

source: From a :term:`configuration file` such as the :ref:`site configuration file <structure-build-conf-site.conf>`, include the following statements::
it_it: Da un :term:`configuration file`, come ad esempio il :ref:`file di configurazione del sito <structure-build-conf-site.conf>`, includere le seguenti istruzioni::

source: From the directory containing the Toaster database, which by default is the :term:`Build Directory`, invoke the ``createsuperuser`` command from ``manage.py``::
it_it: Dalla directory contenente il database di Toaster, che per default è :term:`Build Directory`, richiamare il comando ``createsuperuser`` da ``manage.py``::

source: Full-blown detailed tracing data does however offer the opportunity to manipulate and present the information collected during a tracing run in an infinite variety of ways.
it_it: I dati di tracciamento dettagliati e completi offrono tuttavia l'opportunità di manipolare e presentare le informazioni raccolte durante un'esecuzione di tracciamento in un'infinità di modi.

source: GNU make 4.0 or greater
it_it: GNU make 4.0 o superiore

source: General Considerations
it_it: Considerazioni Generali

source: General Setup
it_it: Configurazione Generale

source: General version upgrades
it_it: Aggiornamenti di versione generali

source: Generating A Public And Private Key Pair With GPG
it_it: Generazione di Una Coppia di Chiavi Pubblica e Privata con GPG

source: Get Toaster to create the database schema, default data, and gather the statically-served files::
it_it: Fare in modo che Toaster crei lo schema del database, i dati di default e raccolga i file statici::

source: Get familiar with the development environment and concepts of the Yocto Project.
it_it: Familiarizzare con l'ambiente di sviluppo e i concetti del progetto Yocto.

source: Get started using the Yocto Project.
it_it: Cominciare ad usare lo Yocto Project.

source: Git 2.22.0 or greater
it_it: Git 2.22.0 o superiore

source: Git Workflows and the Yocto Project
it_it: Flussi di Lavoro Git e Yocto Project

source: Git has an extensive set of commands that lets you manage changes and perform collaboration over the life of a project. Conveniently though, you can manage with a small set of basic operations and workflows once you understand the basic philosophy behind Git. You do not have to be an expert in Git to be functional. A good place to look for instruction on a minimal set of Git commands is `here <https://git-scm.com/docs>`__.
it_it: Git offre un'ampia gamma di comandi che consentono di gestire le modifiche e collaborare durante l'intero ciclo di vita di un progetto. Fortunatamente, è possibile gestirlo anche con un set ridotto di operazioni e flussi di lavoro di base, una volta compresa la filosofia di Git. Non è necessario essere esperti di Git per utilizzarlo. Un buon punto di partenza per imparare i comandi Git di base è `questo <https://git-scm.com/docs>`__.

source: Git repositories use branching techniques that track content change (not files) within a project (e.g. a new feature or updated documentation). Creating a tree-like structure based on project divergence allows for excellent historical information over the life of a project. This methodology also allows for an environment from which you can do lots of local experimentation on projects as you develop changes or new features.
it_it: I repository Git utilizzano tecniche di branching che tengono traccia delle modifiche al contenuto (non ai file) all'interno di un progetto (ad esempio, una nuova funzionalità o la documentazione aggiornata). La creazione di una struttura ad albero basata sulla divergenza del progetto consente di ottenere un'eccellente cronologia delle modifiche durante l'intero ciclo di vita del progetto. Questa metodologia permette inoltre di disporre di un ambiente in cui è possibile effettuare numerose sperimentazioni locali sui progetti durante lo sviluppo di modifiche o nuove funzionalità.

source: Git uses "tags" to mark specific changes in a repository branch structure. Typically, a tag is used to mark a special point such as the final change (or commit) before a project is released. You can see the tags used with the ``yocto-docs`` Git repository by going to :yocto_git:`/yocto-docs/` and clicking on the ``[...]`` link beneath the "Tag" heading.
it_it: Git usa i "tag" per contrassegnare modifiche specifiche nella struttura dei branch di un repository. In genere, un tag viene utilizzato per contrassegnare un punto specifico, come l'ultima modifica (o commit) prima del rilascio di un progetto. È possibile visualizzare i tag utilizzati nel repository Git ``yocto-docs`` accedendo a :yocto_git:`/yocto-docs/` e cliccando sul link ``[...]`` sotto l'intestazione "Tag".

source: Go to :yocto_dl:`/releases/yocto/yocto-6.1_M3/buildtools/`, locate and download the ``.sh`` file corresponding to your host architecture and to :term:`buildtools`, :term:`buildtools-extended` or :term:`buildtools-make`.
it_it: Recarsi nella directory :yocto_dl:`/releases/yocto/yocto-6.1_M3/buildtools/`, individuare e scaricare il file ``.sh`` corrispondente all'architettura del proprio sistema host e a :term:`buildtools`, :term:`buildtools-extended` o :term:`buildtools-make`.

source: Guides on how to contribute to the different parts of the Yocto Project.
it_it: Guide su come contribuire alle diverse parti di Yocto Project.

source: Handling multi-project embargoes
it_it: Gestione degli embarghi multi-progetto

source: Hardware Configuration Options
it_it: Opzioni di Configurazione dell'Hardware

source: Hash Equivalence
it_it: Equivalenza degli Hash

source: Have ``mod-wsgi`` for the Apache webserver.
it_it: Si deve avere ``mod-wsgi`` installato per il server web Apache.

source: Have all the build requirements as described in the ":ref:`toaster-manual/start:Preparing to Use Toaster`" chapter.
it_it: Si devono soddisfare tutti i requisiti di compilazione descritti nel capitolo ":ref:`toaster-manual/start:Preparing to Use Toaster`".

source: Have an Apache webserver.
it_it: Si deve avere un server web Apache.

source: Having :doc:`/test-manual/reproducible-builds` is a key ingredient for the stability of the task's output hash. Therefore, the effectiveness of Hash Equivalence strongly depends on it.
it_it: Avere :doc:`/test-manual/reproducible-builds` è un ingrediente fondamentale per la stabilità dell'hash di output di un task. Pertanto, l'efficacia dell'Hash Equivalence dipende fortemente da essa.

source: Having one instance of the Toaster web server track and capture multiple command-line builds, where each build is started in its own "noweb" Toaster environment.
it_it: Avere un'istanza del server web di Toaster che monitora e acquisisce più build da riga di comando, ognuna delle quali viene avviata nel proprio ambiente Toaster "noweb".

source: Here are challenges you might encounter when developing using the Yocto Project:
it_it: Ecco alcune sfide che si potrebbero incontrare durante lo sviluppo con Yocto Project:

source: Here are components associated with packages for finished targets:
it_it: Ecco i componenti associati ai pacchetti per le piattaforme target:

source: Here are components associated with the :term:`OpenEmbedded Build System`:
it_it: Ecco i componenti associati al :term:`OpenEmbedded Build System`:

source: Here are features and advantages of the Yocto Project:
it_it: Ecco le caratteristiche e i vantaggi di Yocto Project:

source: Here are key subdirectories within each recipe work directory:
it_it: Ecco le principali sottodirectory all'interno di ciascuna directory di lavoro della ricetta:

source: Here are recommendations for released BSPs that conform to the Yocto Project:
it_it: Ecco le raccomandazioni per i BSP rilasciati conformi a Yocto Project:

source: Here are several videos that show how to use the Toaster GUI:
it_it: Ecco alcuni video che mostrano come utilizzare l'interfaccia grafica di Toaster:

source: Here are some brief details on these core components. For additional information on how these components interact during a build, see the ":ref:`overview-manual/concepts:openembedded build system concepts`" section.
it_it: Ecco alcuni brevi dettagli su questi componenti principali. Per ulteriori informazioni su come questi componenti interagiscono durante una compilazione, consultare la sezione ":ref:`overview-manual/concepts:openembedded build system concepts`".

source: Here are some common problems that prevent post-installation scripts from running during root filesystem creation:
it_it: Ecco alcuni problemi comuni che impediscono l'esecuzione degli script di post-installazione durante la creazione del filesystem root:

source: Here are the packages needed to build Project documentation manuals:
it_it: Ecco i pacchetti necessari per creare i manuali di documentazione del Progetto:

source: Here are the packages needed to build an image on a headless system with a supported AlmaLinux distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione AlmaLinux supportata:

source: Here are the packages needed to build an image on a headless system with a supported CentOS Stream distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione CentOS Stream supportata:

source: Here are the packages needed to build an image on a headless system with a supported Fedora Linux distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione Fedora Linux supportata:

source: Here are the packages needed to build an image on a headless system with a supported RockyLinux distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione RockyLinux supportata:

source: Here are the packages needed to build an image on a headless system with a supported Ubuntu or Debian Linux distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione Linux Ubuntu o Debian supportata:

source: Here are the packages needed to build an image on a headless system with a supported openSUSE Leap 15.6 distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione openSUSE Leap 15.6 supportata:

source: Here are the packages needed to build an image on a headless system with a supported openSUSE Leap 16.0 distribution:
it_it: Ecco i pacchetti necessari per creare un'immagine su un sistema senza interfaccia grafica con una distribuzione openSUSE Leap 16.0 supportata:

source: Here are the settings for letting ``git send-email`` send e-mail through your regular STMP server, using a Google Mail account as an example::
it_it: Ecco le impostazioni per consentire aHere are the settings for letting ``git send-email`` di inviare email tramite il tuo server SMTP abituale, utilizzando un account Google Mail come esempio::

source: Here are the steps to take to build and run your own :term:`buildtools` installer:
it_it: Ecco i passaggi da seguire per creare ed eseguire il proprio programma di installazione di :term:`buildtools`:

source: Here are tools that help with production related activities using the Yocto Project:
it_it: Ecco alcuni strumenti utili per le attività di produzione con Yocto Project:

source: Here are tools that help you develop images and applications using the Yocto Project:
it_it: Ecco gli strumenti che aiutano a sviluppare immagini e applicazioni utilizzando Yocto Project:

source: Here is a brief summary of the "workflow":
it_it: Ecco un breve riepilogo del "workflow":

source: Here is a list of terms and definitions users new to the Yocto Project development environment might find helpful. While some of these terms are universal, the list includes them just in case:
it_it: Ecco un elenco di termini e definizioni che potrebbero essere utili agli utenti che si avvicinano per la prima volta all'ambiente di sviluppo del Yocto Project. Sebbene alcuni di questi termini siano universali, l'elenco li include per completezza:

source: Here is a non-exhaustive list:
it_it: Ecco un elenco non esaustivo:

source: Here is a sample Apache configuration for Toaster you can follow:
it_it: Ecco un esempio di configurazione Apache per Toaster che si può seguire:

source: Here is a specific example to help you better understand the process. This example customizes a recipe by adding a BSP-specific configuration file named ``interfaces`` to the ``init-ifupdown_1.0.bb`` recipe for machine "xyz" where the BSP layer also supports several other machines:
it_it: Ecco un esempio specifico per aiutarti a comprendere meglio il processo. Questo esempio personalizza una ricetta aggiungendo un file di configurazione specifico per BSP denominato ``interfaces`` alla ricetta ``init-ifupdown_1.0.bb`` per la macchina "xyz", dove il layer BSP supporta anche diverse altre macchine:

source: Here is an example for the extended installer::
it_it: Ecco un esempio per il programma di installazione esteso::

source: Here is an example of fixing CVE security issues with patch files, an example from the :oe_layerindex:`ffmpeg recipe for dunfell </layerindex/recipe/122174>`::
it_it: Ecco un esempio di come correggere le vulnerabilità di sicurezza CVE con i file di patch, tratto dalla ricetta :oe_layerindex:`ffmpeg recipe per dunfell </layerindex/recipe/122174>`::

source: Here is an example that assumes the software has a ``COPYING`` file::
it_it: Ecco un esempio che presuppone che il software abbia un file ``COPYING``::

source: Here is an overview of the file format used by the ``oe-core.xml``, ``poky.xml``, and ``custom.xml`` files.
it_it: Ecco una panoramica del formato dei file utilizzati da ``oe-core.xml``, ``poky.xml`` e ``custom.xml``.

source: Here is the bootstrap process for the relocatable toolchain::
it_it: Ecco il processo di bootstrap per la toolchain rilocabile::

source: Here is the general procedure on how to create patches to be sent through email:
it_it: Ecco la procedura generale per creare patch da inviare via email:

source: Here is what you can get from this manual:
it_it: Ecco cosa c'è in questo manuale:

source: Here we see entries not only for our ``wget`` load, but for other processes running on the system as well:
it_it: Qui vediamo voci non solo per il carico di ``wget``, ma anche per altri processi in esecuzione sul sistema:

source: Here's a command you can use if you just have one patch in your branch::
it_it: Ecco un comando utilizzabile se è stata cambiata una sola patch nel proprio branch::

source: Here's a patch that has been backported from an upstream commit::
it_it: Ecco una patch che è stata retroportata da un commit upstream::

source: Here's an example of a patch that has been submitted upstream::
it_it: Ecco un esempio di patch inviata in upstream::

source: Here's another example, this time a display resulting from tracing ``all events``:
it_it: Ecco un altro esempio, questa volta una visualizzazione risultante dalla traccia di ``all events``:

source: Historically, the Build Appliance was the second of three methods by which you could use the Yocto Project on a system that was not native to Linux.
it_it: Storicamente, la Build Appliance era il secondo di tre metodi per utilizzare il Yocto Project su un sistema non nativo Linux.

source: Historically, the Yocto Project integrated the OE-Core metadata throughout the Yocto Project source repository reference system (Poky). After Yocto Project Version 1.0, the Yocto Project and OpenEmbedded agreed to work together and share a common core set of metadata (OE-Core), which contained much of the functionality previously found in Poky. This collaboration achieved a long-standing OpenEmbedded objective for having a more tightly controlled and quality-assured core. The results also fit well with the Yocto Project objective of achieving a smaller number of fully featured tools as compared to many different ones.
it_it: Storicamente, Yocto Project integrava i metadati di OE-Core in tutto il sistema di riferimento dei repository sorgente di Yocto Project (Poky). Dopo la versione 1.0 di Yocto Project, Yocto Project e OpenEmbedded hanno concordato di collaborare e condividere un set di metadati di base comune (OE-Core), che contiene gran parte delle funzionalità precedentemente presenti in Poky. Questa collaborazione ha permesso di raggiungere un obiettivo di lunga data di OpenEmbedded: avere un core più strettamente controllato e di qualità garantita. I risultati si integrano perfettamente anche con l'obiettivo di Yocto Project di ottenere un numero ridotto di strumenti completi, anziché un gran numero di strumenti diversi.

source: Host Requirements
it_it: Requisiti dell'Host

source: How Stable Release Regexes Work
it_it: Come Funzionano le Espressioni Regolari per le Release Stabili

source: How are changed pieces of software removed and replaced?
it_it: Come vengono rimosse e sostituite le parti di software modificate?

source: How are pre-built components that do not need to be rebuilt from scratch used when they are available?
it_it: Come vengono utilizzati i componenti precompilati che non necessitano di essere ricostruiti da zero, quando sono disponibili?

source: How to report a potential security vulnerability?
it_it: Come segnalare una potenziale vulnerabilità di sicurezza?
